In [2]:
people = {
    "first": ["Mallikharjun"],
    "last": ["Namagiri"],
    "email": ["mallik.namagiri@gmail.com"]
}

In [55]:
people = {
    "first": ["Mallikharjun", "Peter", "Srini"],
    "last": ["Namagiri", "Kata", "Kata"],
    "email": ["mallik.namagiri@gmail.com", "peter.kata@gmail.com", "srini.kata@gmail.com"]
}

In [4]:
import pandas as pd

In [56]:
df = pd.DataFrame(people)

In [57]:
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [7]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [11]:
df.columns = ['email', 'first_name', 'last_name']
df

                       email    first_name last_name
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [12]:
df.columns = [x.upper() for x in df.columns]
df

                       EMAIL    FIRST_NAME LAST_NAME
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [15]:
df.columns = df.columns.str.replace(' ', '_')
df

                       email    first_name last_name
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [16]:
df.columns = [x.lower() for x in df.columns]
df

                       email    first_name last_name
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [17]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [18]:
df.loc[2]

email    srini.kata@gmail.com
first                   Srini
last                     Kata
Name: 2, dtype: object

In [20]:
df.loc[2] = ['srinilotla@gmail.com', 'Srini', 'lotla']
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srinilotla@gmail.com         Srini     lotla

In [21]:
df.loc[2, ['last', 'email']]

last                    lotla
email    srinilotla@gmail.com
Name: 2, dtype: object

In [22]:
df.loc[2, ['last', 'email']] = ['Kata', 'srini.kata@gmail.com']
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [23]:
df.loc[2, 'last'] = 'lotla'
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini     lotla

In [24]:
df.at[2, 'last'] = 'Kata'
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [26]:
# common error people do
filt = (df['email'] == 'peter.kata@gmail.com')
df[filt]['last']

1    Kata
Name: last, dtype: object

In [27]:
# common error people do
filt = (df['email'] == 'peter.kata@gmail.com')
df[filt]['last'] = 'Srini'

C:\Users\Maanvitha\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [29]:
filt = (df['email'] == 'peter.kata@gmail.com')
df.loc[filt, 'last'] = 'Srini'
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter     Srini
2       srini.kata@gmail.com         Srini      Kata

In [31]:
df['email'].str.upper()

0    MALLIK.NAMAGIRI@GMAIL.COM
1         PETER.KATA@GMAIL.COM
2         SRINI.KATA@GMAIL.COM
Name: email, dtype: object

In [33]:
df['email'] = df['email'].str.lower()
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter     Srini
2       srini.kata@gmail.com         Srini      Kata

apply
map
applymap
replace

In [34]:
df['email'].apply(len)

0    25
1    20
2    20
Name: email, dtype: int64

In [35]:
# normal functions
def update_email(email):
    return email.upper()

In [36]:
df['email'].apply(update_email)

0    MALLIK.NAMAGIRI@GMAIL.COM
1         PETER.KATA@GMAIL.COM
2         SRINI.KATA@GMAIL.COM
Name: email, dtype: object

In [38]:
df['email'] = df['email'].apply(update_email)
df

                       email         first      last
0  MALLIK.NAMAGIRI@GMAIL.COM  Mallikharjun  Namagiri
1       PETER.KATA@GMAIL.COM         Peter     Srini
2       SRINI.KATA@GMAIL.COM         Srini      Kata

In [39]:
# lambda functions
df['email'] = df['email'].apply(lambda x: x.lower())
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter     Srini
2       srini.kata@gmail.com         Srini      Kata

In [40]:
df['email'].apply(len)

0    25
1    20
2    20
Name: email, dtype: int64

In [41]:
df.apply(len) # lenth of the columns

email    3
first    3
last     3
dtype: int64

In [45]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [43]:
len(df['email'])

3

In [46]:
df.apply(pd.Series.min)

email    mallik.namagiri@gmail.com
first                 Mallikharjun
last                          Kata
dtype: object

In [48]:
df.apply(lambda x: x.min())

email    mallik.namagiri@gmail.com
first                 Mallikharjun
last                          Kata
dtype: object

In [49]:
# applymap will work on only dataframes
df.applymap(len)

   email  first  last
0     25     12     8
1     20      5     5
2     20      5     4

In [51]:
df.applymap(str.lower)

                       email         first      last
0  mallik.namagiri@gmail.com  mallikharjun  namagiri
1       peter.kata@gmail.com         peter     srini
2       srini.kata@gmail.com         srini      kata

In [60]:
# map will work on only series of values
df['first'].map({'Mallikharjun': 'Arjun', 'Peter': 'srinu'})

0    Arjun
1    srinu
2      NaN
Name: first, dtype: object

In [61]:
# map will work on only series of values
df['first'].replace({'Mallikharjun': 'Arjun', 'Peter': 'srinu'})

0    Arjun
1    srinu
2    Srini
Name: first, dtype: object

In [62]:
# map will work on only series of values
df['first'] = df['first'].replace({'Mallikharjun': 'Arjun', 'Peter': 'srinu'})
df

                       email  first      last
0  mallik.namagiri@gmail.com  Arjun  Namagiri
1       peter.kata@gmail.com  srinu      Kata
2       srini.kata@gmail.com  Srini      Kata